Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཅི་ནུས་སུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་དགོས་པས་བརྩོན་འགྲུས་ལ་ཡོངས་སུ་སྐྱོ་བ་མི་འབྱུང་བར་བྱ་བའི་ཕྱིར་ཆོས་བཤད་པར་བྱའོ།
en: As much as they are able, they have to bring beings to maturity without becoming discouraged when persevering, so they must give “an exposition of dharmas.”

source: །དང་པོ་སྨོན་ལམ་ནས་བཟུང་ནས་བདེན་པའི་ཚིག་ལ་གུས་པར་བྱ་སྟེ།
en: And, starting from the first prayer that is a vow, they should have respect for “truth statements.”

source: འདི་དག་ནི་ཡོངས་སུ་སྦྱང་བ་བཅུ་པོ་དག་གིས་མཚམས་སྦྱར་བའོ།
en: These are linked up with “the ten purifications.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ས་ཡིན་པའི་ས་གཉིས་པ་ལ་ཡང་ཚུལ་ཁྲིམས་ཡིད་ལ་བྱེད་དོ། །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་སྤེལ་བའི་ཕྱིར་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཚོར་བ་ཡིད་ལ་བྱེད་དོ། །སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་ལ་མི་ལྟ་བའི་ཕྱིར་བཟོད་པ་ཡིད་ལ་བྱེད་དོ།
en: On “the second level,” the level of the perfection of morality, they “pay attention to… morality,” and pay attention to “a feeling of appreciation and gratitude” in order to increase love for all beings.

source: །སེམས་ཅན་གྱི་རྒྱུད་སྣོད་དུ་རུང་བར་བྱ་བའི་ཕྱིར་མཆོག་ཏུ་དགའ་བ་ཡིད་ལ་བྱེད་དོ། །རྩོམ་པ་ཐམས་ཅད་ཀྱི་རྩ་བ་ནི་དེ་དག་ཡིན་པས་སེམས་ཅན་ཡོངས་སུ་མི་གཏོང་བ་ཡིད་ལ་བྱེད་དོ། །བདག་གི་སྡུག་བསྔལ་གྱི་འདུ་ཤེས་རྣམ་པར་བཟློག་པའི་ཕྱིར་སྙིང་རྗེ་ཡིད་ལ་བྱེད་དོ། །གུས་པ་བསྐྱེད་པའི་ཕྱིར་བླ་མ་རྣམས་ལ་དད་པས་འཕངས་པར་ཡིད་ལ་བྱེད་དོ། །བྱང་ཆུབ་ཀྱི་ཚོགས་ཀྱི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱེད་དེ།
en: They pay attention to “patience” in order not to look at the shortcomings of beings; pay attention to “great delight” in order to transform the mindstreams of beings into suitable vessels; pay attention to “not ignoring any being” because they are the root of all undertakings; pay attention to “compassion” in order to stop the idea of personal suffering; pay attention motivated by “faith in gurus” in order to generate “reverence,” and pay attention to “the perfections” because they are the equipment for awakening.

source: ཡིད་ལ་བྱེད་པ་བརྒྱད་དོ།
en: These are “the eight attentions.”

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་ཡོངས་སུ་བསྔོ་བ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་ནས་དགེ་བའི་རྩ་བ་འདིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་བསྔོ་བའོ།
en: In raising up and transforming wholesome roots for the purification of a buddhafield” they dedicate them, having planted roots for the purification of a buddhafield, thinking, “May these wholesome roots purify a buddhafield.”

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཞེས་བྱ་བའི་དངོས་པོ་ནི་གང་ཡང་མེད་ཀྱི།
en: There is no “buddhafield” at all that is a real thing.

source: བདག་དང་གཞན་དག་ལ། དེ་ལྟ་དེ་ལྟ་བུར་སྣང་བ་ཙམ་དུ་ཟད་པས།
en: It simply appears in this or that way to themselves and others.

source: སེམས་ཅན་ཡོངས་སུ་སྦྱང་བ་ཉིད་ལ་དེ་སྐད་ཅེས་བྱའོ།
en: That locution is used just for the purification of beings. “

source: །དགོན་པ་ལ་གནས་པ་ཡོངས་སུ་མི་གཏང་བ་ཞེས་བྱ་བ་ལ་དགོན་པ་ལ་གནས་པ་ཞེས་བྱ་བའི་སྒྲ་ནི་འདིར་ནགས་ཚལ་ན་གནས་པ་ལ་ནི་མི་བྱའི།
en: Not giving up dwelling in the forest”— the locution “dwelling in the forest” here should not be taken to mean living in the woods.

source: སེམས་འདྲེ་བ་མེད་པར་གནས་པ་དང་། དབེན་པར་གནས་པ་ལ་འདིར་དགོན་པ་ལ་གནས་པ་ཞེས་བྱའོ།
en: Here “dwelling in the forest” is dwelling with thoughts that are unmixed and abiding in isolation.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་འདྲེ་བ་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་། རང་བྱང་ཆུབ་ཡིད་ལ་བྱེད་པའི་དབང་གིས་འགྱུར་ཏེ།
en: The bodhisattvas’ thoughts become mixed through the force of attention to śrāvaka and pratyekabuddha thoughts.

source: ཇི་སྐད་དུ་རབ་འབྱོར་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱེད་པ་དང་མི་ལྡན་པར་དབེན་པར་གནས་པ་འདི་ནི་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབེན་པ་ཡིན་པར་ངས་རྗེས་སུ་གནང་སྟེ། གལ་ཏེ་དབེན་པ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉིན་མཚན་དུ་གནས་ན་དབེན་པ་ཉིད་དུ་གནས་པའོ་ཞེས་འོག་ནས་བཤད་པ་ལྟ་བུའོ།
en: As it will say later, “Subhūti … these bodhisattva great beings who are dwelling isolated from attention connected with śrāvakas … and pratyekabuddhas … Subhūti, I have endorsed that as the bodhisattva great beings’ isolation … If bodhisattva great beings live day and night in this isolation they truly live in isolation.”

source: །གཞན་ཡང་དེ་དགོན་པ་དང་ནགས་ཚལ་གྱི་ཕྱོགས་དང་། བས་མཐའི་གནས་ན་གནས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པའོ། །དེ་བཞིན་དུ་སྦྱངས་པའི་ཡོན་ཏན་ཞེས་བྱ་བའི་སྒྲ་ཡང་རྣམ་པར་རྟོག་པ་སྦྱོང་བའི་རྒྱུར་གྱུར་པའི་ཡོན་ཏན་རྣམས་ལ་བྱའི། ཕྱག་དར་ཁྲོད་པ་ལ་སོགས་པ་ནི་མ་ཡིན་ནོ།
en: And also, “If they live in jungle, upland forest, and frontier retreats, they live…” Similarly, with the locution “the qualities of the ascetic”— you should take those as qualities that become causes for purifying conceptualization, not as being a refuse-rag wearer and so on.

source: །གང་ལ་བསླབ་པ་ཐམས་ཅད་རྒྱུ་བ་མེད་པ་སྟེ་ཞེས་བྱ་བ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་བྱའོ།
en: Take “where all training is without movement” as the practice of the perfection of wisdom free from conceptualization. “

source: །གང་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ཞེས་བྱ་བ་ནི་གང་ཆོས་ཐམས་ཅད་ལ་གཡོ་བ་ཡོངས་སུ་བཏང་བའོ།
en: Not causing all the dharmas to come into being”— all the dharmas have forsaken movement. “

source: །གང་རྣམ་པར་ཤེས་པ་གནས་པ་ལ་དེའི་སེམས་མི་སྦྱོར་བ་སྟེ་ཞེས་བྱ་བ་ནི་ཀུན་ཏུ་འདྲེ་བར་མི་འགྱུར་ཞིང་། བག་ལ་ཉལ་དུ་མི་འགྱུར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Their minds not connecting with the foundations of consciousnesses” means they are not adulterated and do not give rise to latent tendencies. “

source: །སངས་རྒྱས་སུ་ལྟ་བ་ལ་བརྟེན་པས་སངས་རྒྱས་མཐོང་བར་མི་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་མཐོང་ངོ་སྙམ་ནས་སངས་རྒྱས་སུ་དམིགས་པའི་ལྟ་བས་སངས་རྒྱས་སུ་ལྟ་བ་ལ་གནས་པའི་ཕྱིར་སངས་རྒྱས་མཐོང་བ་མེད་དེ།
en: By resorting to a view of the Buddha they do not see the Buddha.” With a view that apprehends something as the Buddha they think, “I have seen the Buddha,” persisting with a “view of the Buddha,” so “they do not see the Buddha.”

source: མི་དམིགས་པའི་ཡེ་ཤེས་ཉིད་ཀྱིས་སངས་རྒྱས་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means the Buddha is seen with knowledge that does not apprehend anything.

source: །ཆོས་དང་དགེ་འདུན་ལ་ཡང་དེ་བཞིན་ནོ།
en: It is similar with Dharma and Saṅgha as well. “ ‘

source: །འདི་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ནི་མ་ཡིན་གྱི།
en: All dharmas are empty,’ because they are empty of their own particular characteristics, not empty of emptiness.” “

source: རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འདི་ལྟར་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་མཚན་ཉིད་དུ་ནི་ཡོད་པ་མ་ཡིན་གྱི།
en: All dharmas”—form and so on—do not exist as the particular characteristic of falsely imagined form and so on.

source: བརྗོད་དུ་མེད་པའི་མཚན་ཉིད་དོན་དམ་པ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དུ་ནི་མེད་པ་མ་ཡིན་ཏེ།
en: Still, they are not nonexistent as the particular inexpressible characteristic that is the intrinsic nature of the ultimate, emptiness.

source: དེའི་ཕྱིར་སྟོང་པ་ཉིད་ལ་ཐམས་ཅད་ཆད་པར་ལྟ་བའི་རྒྱུ་ལས་བྱུང་བའི་འཇིགས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they do not have to have the fear that comes about caused by the view that in emptiness everything is annihilated. “

source: །རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་སྟོང་པས། སྟོང་པ་ཉིད་ནི་སྟོང་པ་ཉིད་དང་འགལ་བར་མི་བྱེད་པའི་ཕྱིར་ཏེ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་མ་ཡིན་ན། དེ་ལྟ་ན་ནི་མི་སྟོང་པའི་ཆོས་ཤིག་ཡོད་པར་གྱུར་པས་ཆོས་ཐམས་ཅད་སྟོང་ངོ་ཞེས་བྱ་བ་དང་།
en: Because the empty is an emptiness of its own particular characteristic, therefore emptiness does not oppose emptiness”— this means were emptiness not to be empty of emptiness’s own particular characteristic, there would be something that is not empty, and “all dharmas are empty” and this particular characteristic of emptiness would be in opposition and there would then be an emptiness in opposition.

source: སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་འདི་འགལ་བའི་ཕྱིར་སྟོང་པ་ཉིད་འགལ་བར་འགྱུར་བ་ཞིག་ན་འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་གང་ཡང་མེད་པས་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཁས་ལེན་ཏེ།
en: Thus, even emptiness has not become some other dharma, “emptiness,” so it is asserted to be empty of emptiness’s own particular characteristic.

source: དེ་བས་ན་ཆོས་ཐམས་ཅད་སྟོང་ངོ་ཞེས་བྱ་བ་འགྲུབ་པའི་ཕྱིར་སྟོང་པ་ཉིད་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དང་འགལ་བར་མི་བྱེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་སྟོང་གི།
en: Hence it is established that “all dharmas are empty” so “emptiness does not oppose emptiness.” “

source: སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་རྟོགས་པར་མི་བྱེད་ཅེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་གཉིས་པ་མེད་དེ།
en: Because the empty is the emptiness of emptiness and they do not cause emptiness to be realized in emptiness”— there is not a second emptiness in emptiness.

source: དེ་བས་ན་སྟོང་པ་ཉིད་གཉིས་པ་མེད་པའི་ཕྱིར་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་རྟོགས་པར་མི་བྱེད་དོ་ཞེས་བྱ་བར་ཤེས་པ་གང་ཡིན་པ་དེ་དག་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་རྟོགས་པའོ།
en: Therefore, because there is no second emptiness, they do not cause emptiness to be realized in emptiness. Just that knowledge is the realization of emptiness. “

source: །འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བ་ནི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་འཁོར་གསུམ་ཡོངས་སུ་དག་པའོ།
en: Purification of the three spheres” is the purification of the three spheres of actions of body, speech, and thinking mind. “

source: །སེམས་ཅན་གྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཉིད་ཡིན་པའི་ཕྱིར་སེམས་ཅན་གྱི་ཞིང་ཡོངས་སུ་དག་པའོ། །བསྣན་པ་མེད་པ་དང་དབྲི་བ་མེད་པ་ཞེས་བྱ་བ་ལ།
en: Because of the purity of the field of beings”— the field of beings is purified because all beings are just tathāgata­garbha. “

source: ཡོད་པ་སྐུར་པ་མི་འདེབས་པ་ནི་དབྲི་བ་མེད་པའོ། །མེད་པ་སྒྲོ་མི་འདོགས་པ་ནི་བསྣན་པ་མེད་པ་སྟེ།
en: Not adding to and not taking away”— not overly negating what exists is “not taking away”; not overly reifying what does not exist is “not adding to.”

source: ཡང་དག་པར་ཡོད་པ་ལ་སྐུར་པ་མི་འདེབས་པ་དང་། ཡང་དག་པར་མེད་པ་ལ་སྒྲོ་མི་འདོགས་པས་མཉམ་པ་ཉིད་དུ་མཐོང་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they see “sameness” by not overly negating what really exists, and not overly reifying what really does not exist. “

source: །གང་ཆོས་ཐམས་ཅད་རབ་ཏུ་རྟོགས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་རྟོགས་པར་བྱ་བ་དང་།
en: The absence of a realization of all dharmas”— they do not see the two—a realized or a realizer—so the “realization of the way things are perfect… is the absence of a realization.” “

source: རྟོགས་པར་བྱེད་པ་གཉི་ག་མ་མཐོང་བའི་ཕྱིར་རྟོགས་པ་མེད་པ་ཉིད་ཡང་དག་པའི་ཚུལ་རྟོགས་པའོ།
en: The absence of habitual ideas about dual phenomena is the exposition of the one way things are.”

source: །ཆོས་ཉིད་ལ་ཀུན་ཏུ་སྤྱོད་པ་མེད་པ་ཉིད་དེ་ཚུལ་གཅིག་ཏུ་བསྟན་པའོ་ཞེས་བྱ་བ་ནི་དཔེར་ན་ནམ་མཁའ་གཅིག་པུའི་ངོ་བོ་ཡིན་པས། ངོ་བོ་ཉིད་ལ་ཐ་དད་དུ་དབྱེ་བ་མེད་པ་དེ་བཞིན་དུ།
en: To illustrate, just as space is a single entity undivided into different entities, similarly with suchness.

source: དེ་བཞིན་ཉིད་ཀྱང་རྣམ་པ་གཅིག་པའི་ཕྱིར། ཡོད་པ་དང་མེད་པ་དང་། ཆོས་དང་། ཆོས་མ་ཡིན་པ་དང་། རྟག་པ་དང་།
en: Because it is always in the same form, there is “the exposition of the one way things are,” because “of the absence of habitual ideas about dual phenomena” existing and not existing, being a phenomenon and not a phenomenon, being permanent and impermanent, and so on. “

source: མི་རྟག་པ་ལ་སོགས་པའི་ཆོས་གཉིས་ལ་ཀུན་ཏུ་སྤྱོད་པ་མེད་པས་ཚུལ་གཅིག་ཏུ་བསྟན་ཏོ། །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྟ་བ་རྣམས་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྟ་བ་མ་སྤངས་པའི་རྣམ་པར་རྟོག་པ་གང་ཡིན་པ་དེ་དག་ལ་བྱའོ།
en: The views of śrāvakas and pratyekabuddhas”— these should taken as any of those conceptualizations where śrāvaka and pratyekabuddha views have not been abandoned. “

source: །གང་དབང་པོ་དྲུག་པོ་དག་རབ་ཏུ་མི་འཕྲོ་བ་གང་ཡིན་པ་ཞེས་བྱ་བ་ནི་འགྲོ་བ་མེད་ཅིང་འདུ་བའོ།
en: All six faculties do not radiate out.” They are not scattered; they are collected together. “

source: །ཤེས་པ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་རྗེས་སུ་ཆགས་པའི་ས་མ་ཡིན་པ་གང་ཞེ་ན་ཞེས་བྱ་བ་ནི་གང་རྗེས་སུ་ཆགས་པ་དང་།
en: What is not a level of attachment on account of unobstructed knowledge?”

source: ཁོང་ཁྲོ་བ་དང་བྲལ་བའི་ཡེ་ཤེས་དེ་གང་ཞེ་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means: What is the knowledge that is free from attachment and anger? “

source: །གང་ཆོས་ལ་བསྙེན་བཀུར་བ་སྟེ་ཞེས་བྱ་བ་ནི། སུས་ཆོས་མཐོང་བ་དེས་སངས་རྒྱས་མཐོང་ངོ་ཞེས་གསུངས་པའི་ཕྱིར་རོ།
en: It is attending on the Dharma”— this is because it is said, “Whoever sees the Dharma sees the Buddha.” “

source: །བདག་དང་གཞན་གྱི་སེམས་ཅན་གྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའོ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་གྱི་ཞིང་མ་གཏོགས་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཞེས་བྱ་བ་གཞན་མེད་དེ། རྣམ་པར་རིག་པ་ཙམ་དུ་ཟད་པའི་ཕྱིར་རོ།
en: Purifying the” field of my and others’ “minds”— this is because there is no “buddhafield” except the field of the mind, because it is simply just a representation. “

source: །གང་རྣམ་པར་སྨིན་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ལ་རྩོལ་བ་མེད་པའི་ཕྱིར་དོན་དམ་པར་རྩོལ་བ་དང་བཅས་པའི་སྤྱོད་པའི་ས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་ཏེ། དགེ་བའི་ཆོས་རྣམས་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་གནས་སོ།
en: Matured meditative stabilization”— at the eighth level there is no effort, so, ultimately, all the levels in which there is an effort at practice are completed, which is to say, wholesome dharmas abide in their matured form.

source: །དེ་བས་ན་སྔོན་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པའི་རྣམ་པར་སྨིན་པར་གྱུར་པའི་ཏིང་ངེ་འཛིན་རྣམས་ལྷུན་གྱིས་གྲུབ་པ་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཉེ་བར་འདུ་སྟེ། དེ་བས་ན་མཉམ་པར་གཞག་པ་ཞེས་བྱའོ།
en: Hence the meditative stabilizations that are the maturations of earlier absorptions in meditative stabilization are spontaneously drawn into the bodhisattvas, so it says “absorbed in meditation.” “

source: །སྤོབས་པའི་ཀླུང་ནི་སྤོབས་པའི་རྒྱུན་དང་། ཚུལ་དང་། སྤོབས་པ་རྒྱུན་དུ་འབྱུང་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: A river of confidence” means a continuum of confidence, a demeanor, a confidence that arises continually. “

source: །རྫུས་ཤིང་སྐྱེ་བ་སྟེ་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་ཡན་ཆད་ནི་མངལ་ན་གནས་པ་མེད་དེ།
en: Taking birth miraculously”— from the eighth level they do not gestate in a womb.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་ནི་དེ་ལྟ་བུར་ཡང་སྟོན་ཏོ།
en: They make such a demonstration only for the sake of bringing beings to maturity. “

source: །དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ཞེས་བྱ་བ་ནི་མོས་པས་སྤྱོད་པའི་སའོ། །རིགས་ཀྱི་ས་ཞེས་བྱ་བ་ནི་བཟོད་པ་ཆེན་པོའི་སའོ། །བརྒྱད་པའི་ས་ཞེས་བྱ་བ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་འཇུག་པའི་ས་སྟེ། དེ་ནི་དགྲ་བཅོམ་པའི་འབྲས་བུ་ལ་གནས་པ་ནས་བཟུང་སྟེ་བགྲངས་ནས་བརྒྱད་པར་འགྱུར་རོ། །མཐོང་བའི་ས་ཞེས་བྱ་བ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གནས་པའི་སའོ།
en: Śuklavipaśyanā level” is the devoted course of conduct level; “Gotra level” is the great forbearance level; “Aṣṭamaka level” is the level of a candidate for the result of stream enterer, because it is the eighth counting down from recipient of the result of worthy one; “Darśana level” is the level of recipient of the result of stream enterer; “Tanū level” is the level of a once-returner, because with the exception of the remaining attachments that have been severely depleted, attachments and so on to sense objects have ended; and “Vītarāga level” is the level of a non-returner, because the desire to experience sense objects, and malice, have been perfectly cut, so it is free from attachment and so on to sense objects.

source: །བསྲབས་པའི་ས་ཞེས་བྱ་བ་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་ས་སྟེ། དེའི་འདོད་པའི་འདོད་ཆགས་ལ་སོགས་པ་སྲབ་མོར་བྱས་པ་ཙམ་དུ་ཟད་དོ། །འདོད་ཆགས་དང་བྲལ་བའི་ས་ནི་ཕྱིར་མི་འོང་བ་སྟེ། དེས་འདོད་པ་ལ་འདུན་པ་དང་གནོད་སེམས་ཡང་དག་པར་བཅད་པ་དང་འདོད་པའི་འདོད་ཆགས་དང་བྲལ་བ་ཡིན་ནོ།
en: The “Kṛtāvin level” is the level of a worthy one.

source: །བྱས་པ་རྟོགས་པ་ཅན་གྱི་ས་ནི་དགྲ་བཅོམ་པ་ཉིད་དེ། བྱ་བ་བྱས་སོ་ཞེས་ཁོང་དུ་ཆུད་པ་ནི་བྱས་པ་རྟོགས་པ་སྟེ།
en: The comprehension that “the work to be done is done” is “knowledge that it is done.”

source: དེ་འདི་ལ་ཡོད་པས་ན་བྱས་པ་རྟོགས་པ་ཅན་ཞེས་བྱ་སྟེ་དགྲ་བཅོམ་པའོ།
en: Because of having that, the “one with knowledge that it is done” is the worthy one.

source: །ཡང་ན་འདི་བྱས་པ་ཁོང་དུ་ཆུད་པའི་ངང་ཚུལ་ཅན་ཡིན་པས་བྱས་པ་རྟོགས་པ་ཅན་ཏེ། དེའི་ས་ནི་བྱས་པ་རྟོགས་པ་ཅན་གྱི་སའོ།
en: Alternatively, Kṛtāvins have as their nature a comprehension of what has been done, and their level is the Kṛtāvin level.

source: །དེ་ལྟར་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་བསྟན་ནས།
en: From where will the Great Vehicle go forth?

source: དེའི་འོག་ཏུ་ཐེག་པ་དེ་གང་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ཞེས་བྱ་བ་ཞུས་པས་གསུམ་པ་བརྩམས་ཏེ། ཁམས་གསུམ་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ཞིང་།
en: Having thus taught who has set out in the Great Vehicle, then, taking the third question—“From where will that vehicle go forth?”—as its point of departure, it says “it will go forth from the three realms and will stand wherever there is knowledge of all aspects.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་གནས་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དག་ལ་ཡང་ཁམས་གསུམ་ནས་ངེས་པར་འབྱུང་བ་ཡང་ཡོད་པས་དེ་བསལ་བའི་ཕྱིར་ཁམས་གསུམ་ནས་བྱུང་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པར་འགྱུར་རོ་ཞེས་བྱ་བས་ཐེག་པ་ཆེན་པོ་ལ་བྱ་བ་གཉིས་ཡོད་པར་བསྟན་ཏེ།
en: Because the Śrāvaka and Pratyekabuddha Vehicles also “go forth from the three realms,” to make it clear it says “it will go forth from the three realms and will stand in the knowledge of all aspects.”

source: ཐེག་པ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གནས་པར་འགྱུར་ཞེས་གསུངས་པའི་ཕྱིར་རོ།
en: Thus, it teaches two functions of the Great Vehicle, because it says about the Great Vehicle that “it will stand in the knowledge of all aspects.” “

source: །དེ་ཡང་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་གཉིས་ལ་ཐ་དད་པ་ཡོད་དོ་སྙམ་དུ་ལོག་པར་ཞུགས་པ་རྣམས་ལ་འབྲས་བུ་ཐ་དད་པ་མེད་པར་སྟོན་ཏེ།
en: Furthermore, by way of nonduality”— this is teaching that a different result does not exist, to those who come at it incorrectly, thinking “there are two, so they are different.”

source: ཐེག་པ་ཆེན་པོ་ལ་འབྲས་བུའི་གནས་སྐབས་ན་སངས་རྒྱས་ཉིད་དུ་ཟད་པས་ཐེག་པ་ཆེན་པོ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཐ་དད་པ་མེད་དོ།
en: In the Great Vehicle, during the result period there is simply a state of awakening, so there is no difference between the Great Vehicle and the knowledge of all aspects.

source: །དེ་བས་ན་གཉིས་སུ་མེད་པ་ཉིད་དེ། དེའི་ཕྱིར་ཆོས་འདི་གཉིས་ནི་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: They are therefore a “nonduality,” and hence it says that these two dharmas “are not conjoined and not disjoined,” and so on.

source: གཅིག་པ་དང་ཐ་དད་པའི་མཚན་ཉིད་མེད་པར་བསྟན་པའོ།
en: It is teaching that they are not marked as being the same or different.

source: །ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ལ། གཅིག་པ་མེད་པའི་ཕྱིར་ལྡན་པ་ཡང་མ་ཡིན་ནོ། །ཐ་དད་པ་མེད་པའི་ཕྱིར་མི་ལྡན་པ་ཡང་མ་ཡིན་ནོ།
en: In regard to their being “not conjoined and not disjoined,” they are “not conjoined” because they are not one; they are “not disjoined” because they are not different.

source: །འཛུགས་པར་མི་བྱེད་པའི་ཕྱིར་གཟུགས་མེད་པའོ།
en: They are “formless” because they do not cause anything to become firmly planted.

source: །བསྟན་པར་མི་ནུས་པས་བསྟན་དུ་མེད་པའོ།
en: They “cannot be pointed out,” because they cannot be shown.

source: །འདི་གཉིས་ཀྱིས་ནི་འཛིན་པ་དང་། གཟུང་བ་མེད་པར་བསྟན་ཏེ།
en: These two teach that there is no grasper or grasped.

source: གང་གི་ཕྱིར་འཛུགས་པར་མི་བྱེད་པ་དེའི་ཕྱིར་འཛིན་པ་མེད་པའོ།
en: There is no grasper because there is nothing causing anything to become firmly planted.

source: །གང་གི་ཕྱིར་བསྟན་པར་མི་ནུས་པ་དེའི་ཕྱིར་གཟུང་བ་མེད་པའོ།
en: There is no grasped because they cannot be shown.

source: །ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་འདིས་ནི་དབང་པོ་དང་། ཡུལ་ལྟར་ཐོགས་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་ཡུལ་དང་། ཡུལ་ཅན་མེད་པར་བསྟན་པའོ།
en: They “do not obstruct”— this is teaching that there is no object or object-possessor because they are not marked by obstructing, as are a faculty and an object.

source: །དེ་ལྟར་མཚན་ཉིད་མེད་པའི་ཕྱིར་མཚན་ཉིད་མེད་པ་སྟེ། གཉི་ག་ཡང་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའི་ཕྱིར། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Because they do not have marks and hence have “no mark,” and because both, without marks, have a single mark, it says they “have only one mark—that is, no mark.” “

source: །རབ་འབྱོར་མཚན་ཉིད་མེད་པའི་ཆོས་ལ་ནི་འབྱུང་བའམ། འབྱུང་བར་འགྱུར་བའམ། འབྱུང་བར་འགྱུར་བ་མེད་དོ་ཞེས་བྱ་བ་ནི།
en: Because, Subhūti, a dharma without a mark is not going forth, nor will it go forth, nor has it gone forth.”

source: འདི་ལྟར་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ནི་ཀུན་བརྟགས་པའི་མཚན་ཉིད་ཐམས་ཅད་དང་བྲལ་ཞིང་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་སྟེ།
en: Because thoroughly established dharmas are free from all falsely imagined marks, they are in their nature purified.

source: དེའི་ཕྱིར་རང་བཞིན་གྱིས་ངེས་པར་འབྱུང་ཟིན་པས་དེ་ལ་གློ་བུར་གྱི་ངེས་པར་འབྱུང་བ་མེད་དོ།
en: They have, therefore, in their nature already gone forth, so they do not, plucked out of thin air, go forth. “

source: །རབ་འབྱོར་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་ལས་ངེས་པར་འབྱུང་བར་འདོད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་འབྱུང་བར་འདོད་དུ་ཟད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་གློ་བུར་གྱི་ངེས་པར་འབྱུང་བ་མེད་པ་དེ་ཉིད་རྒྱ་ཆེར་བསྟན་ཏོ།
en: Subhūti, someone who would assert that dharmas without marks go forth might as well assert of suchness that it goes forth,” and so on, teaches in detail that they do not, plucked out of thin air, go forth.

source: །དེ་བཞིན་ཉིད་ནི་རང་བཞིན་ཉིད་ཀྱིས་ཅིས་ཀྱང་མ་གོས་ཤིང་ནམ་མཁའ་ལྟ་བུ་ལ་ངེས་པར་འབྱུང་བ་མེད་དོ།
en: Suchness in its very nature is not stained by anything, and like space does not go forth.

source: །དེ་བས་ན་རབ་འབྱོར་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི་ཁམས་གསུམ་ནས་ངེས་པར་འབྱུང་བ་མེད་དོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: Therefore it says, “Subhūti, the intrinsic nature of suchness does not go forth from the three realms.” “

source: །དེ་བཞིན་ཉིད་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཅེས་བྱ་བ་ཀུན་བརྟགས་པ་གང་ཡང་མེད་ན།
en: Suchness is empty of the intrinsic nature of suchness.”

source: གང་གི་ཕྱིར་དེ་དེ་ལས་ངེས་པར་འབྱུང་བར་འགྱུར།
en: The falsely imagined “intrinsic nature of suchness” does not exist at all in “suchness,” so because of what will it go forth from there?

source: དེ་བཞིན་ཉིད་ལ་སོགས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པའི་བར་འོག་ནས་འབྱུང་བ་དག་ནི་སྔར་བཤད་ཟིན་ཏོ། །སྤོང་བའི་དབྱིངས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་དང་།
en: I have already explained “suchness” and so on, ending with “the inconceivable element,” earlier. “

source: འགོག་པའི་དབྱིངས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དེ་ཉོན་མོངས་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པའི་སྤྲོས་པ་ཐམས་ཅད་སྤོང་བའི་རྒྱུ་ཡིན་པའི་ཕྱིར་སྤོང་བའི་དབྱིངས་ཞེས་བྱའོ། །སྲིད་པ་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བའི་རྒྱུ་ཡིན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་འདས་པའི་ཕྱིར་འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་ཞེས་བྱའོ། །སྡུག་བསྔལ་ཐམས་ཅད་འགོག་པའི་རྒྱུ་ཡིན་པས་འགོག་པའི་དབྱིངས་ཞེས་བྱའོ།
en: The abandonment element, the detachment element, and the cessation element”— that “suchness” is itself called the abandonment element because it causes the abandonment of all thought constructions that are afflicted obscurations and obscurations to knowledge; it is called the detachment element because it causes separation from attachment to the three states of being and is beyond all worlds; and it is called the cessation element because it causes the cessation of all suffering.

source: །མིང་དང་མཚན་མ་དང་བརྡ་དང་། ཐ་སྙད་དང་། གདགས་པ་ཞེས་བྱ་བ་ཚིག་ལྔ་པོ་དག་གིས་ནི་ཀུན་བརྟགས་པ་བསྡུ་སྟེ།
en: The five words— “name… causal sign… conventional term… communication… or a designation”— incorporate the falsely imagined.

source: དཔེར་ན་བ་ལང་གི་རྫས་ལ་བ་ལང་ཞེས་བྱ་བ་ནི་མིང་ངོ་། །ལྐོག་ཤལ་དང་མཇུག་མ་ལ་སོགས་པ་ནི་མཚན་མའོ། །ཟལ་མོའི་བུ་དམར་མོའི་བུ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བརྡའོ། །བ་ཁྲིད་དེ་ཤོག་བ་ཞོས་ཤིག་ཅེས་བྱ་བ་ལ་སོགས་པ་ནི་ཐ་སྙད་དོ།
en: To illustrate, “cow” said of the materiality of a cow is a name; its dewlap, hump, and so on are its causal sign; “the one that has the red calf,” “the one that has the white calf” are conventional terms; “bring the cow here and milk it!”

source: །བརྗོད་པ་ཐམས་ཅད་ནི་གདགས་པའོ།
en: is a communication; and all expressions are designations.

source: །སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་ཞེས་བྱ་བ་ནི་ཚིག་ལྔ་པོ་དག་གིས་ཡོངས་སུ་གྲུབ་པ་བསྡུས་ཏེ།
en: The five words— “nonproduction… nonstopping… nondefilement… nonpurification… and not occasioning anything”— incorporate the thoroughly established.
